Documents/УстановкаМинимальнойСтоимостиПродукции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>УстановкаМинимальнойСтоимостиПродукции</Name>
			<Comment>#7423</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.МинимальнаяСтоимостьПродукции</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Фактура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Фактура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦветФактуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦветФактуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Шаблон</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШаблоныПродукции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МинимальнаяСтоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособОпределения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыОпределенияМинимальнойЦеныНаПродукцию</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПорядокНаценки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПорядокНаценкиМинимальнойЦеныНаПродукцию</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/МинимальнаяСтоимостьПродукции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>МинимальнаяСтоимостьПродукции</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОпределения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОпределенияМинимальнойЦеныНаПродукцию</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядокНаценки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядокНаценкиМинимальнойЦеныНаПродукцию</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фактура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фактура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦветФактуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦветФактуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныПродукции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УДАЛИТЬ_Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ПорядокНаценкиМинимальнойЦеныНаПродукцию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ПорядокНаценкиМинимальнойЦеныНаПродукцию</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаПолотно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПропорциональноНаВсеСоставляющиеПотолка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СпособыОпределенияМинимальнойЦеныНаПродукцию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СпособыОпределенияМинимальнойЦеныНаПродукцию</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Полотно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВесьПотолокССоставляющими</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/УстановкаМинимальнойСтоимостиПродукции/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если Параметры.Ключ.Пустая() Тогда
	Иначе
		ЭтаФорма.ТолькоПросмотр = ПраваПользователей.ДокументТолькоПросмотр(Объект.Ссылка);
	КонецЕсли;
		
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Элементы.ПодменюПечать.Доступность = ПраваПользователей.ДоступностьПечати(Объект.Ссылка);	
	ПраваПользователей.УстановитьТолькоПросмотрДляРеквизитаНомер(Элементы.Номер.ТолькоПросмотр);
	
	//УстановитьВидимость();
	
	//УстановитьУсловноеОформление();
	
	УправлениеФормойПоВидуНоменклатуры();
	
	ФинансыСервер.ОбновитьВидимостьИКурсВалюты(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "ОбщаяФорма.ФормаПодбораФактуры" Тогда	
		ОбработкаВыбораПодборНаКлиенте(ВыбранноеЗначение);
		
	ИначеЕсли ИсточникВыбора.ИмяФормы = "ОбщаяФорма.ФормаПодбораШаблоновПродукции" Тогда	
		ОбработкаВыбораПодборНаКлиенте(ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ДатаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	
	ФинансыСервер.ОбновитьВидимостьИКурсВалюты(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	ВалютаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВалютаПриИзмененииНаСервере()
	
	ФинансыСервер.ОбновитьВидимостьИКурсВалюты(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидНоменклатурыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	//СтандартнаяОбработка = Ложь; // #16747  закомментировано
	СтарыйВидНоменклатуры = Объект.ВидНоменклатуры;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидНоменклатурыПриИзменении(Элемент)
	
	Если НЕ СтарыйВидНоменклатуры = Объект.ВидНоменклатуры
		И (СтарыйВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Продукция")
			ИЛИ Объект.ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Продукция")) Тогда
		Если Объект.Материалы.Количество() > 0 Тогда
			ТекстВопроса = "Табличная часть с ценами будет очищена. Продолжить?";
			ОписаниеОповещения = Новый ОписаниеОповещения("ВидНоменклатурыПриИзмененииЗавершение", ЭтотОбъект);
			ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Иначе
			УправлениеФормойПоВидуНоменклатуры();
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ВидНоменклатурыПриИзмененииЗавершение(Результат, ДополнительныеПарраметры) Экспорт
	
	Если Не Результат = КодВозвратаДиалога.Да Тогда
		Объект.ВидНоменклатуры = СтарыйВидНоменклатуры;
		
	Иначе 
		Объект.Материалы.Очистить();
		УправлениеФормойПоВидуНоменклатуры();
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаКлиенте
Процедура ОбработкаВыбораПодборНаКлиенте(ВыбранноеЗначение)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
			
	ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение);
		
КонецПроцедуры

&НаСервере
Функция ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение)
		
	ТаблицаДанныхПодбора = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресВХранилище);
	Если Не ЭтоПродукция Тогда
		УстановкаЦенСервер.ОбработкаВыбораПодбораФактуры(ТаблицаДанныхПодбора, Объект.Материалы);
	Иначе
		УстановкаЦенСервер.ОбработкаВыбораПодбораШаблонов(ТаблицаДанныхПодбора, Объект.Материалы);
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура УправлениеФормойПоВидуНоменклатуры() 
	
	ЭтоПродукция = (Объект.ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Продукция"));
	Элементы.МатериалыФактура.Видимость 			= НЕ ЭтоПродукция;
	Элементы.МатериалыЦветФактуры.Видимость    		= НЕ ЭтоПродукция;
	Элементы.МатериалыШаблон.Видимость  			= ЭтоПродукция;
	Элементы.МатериалыСпообОпределения.Видимость 	= НЕ ЭтоПродукция;
	Элементы.МатериалыПорядокНаценки.Видимость    	= НЕ ЭтоПродукция;
	
	Элементы.ГруппаКомандПотолки.Видимость     = НЕ ЭтоПродукция;
	Элементы.ГруппаКомандПродукция.Видимость = ЭтоПродукция;
		
КонецПроцедуры

#КонецОбласти

#Область СтандартныеПодсистемы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ОчиститьСообщения();
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
Процедура ПодобратьМатериалы(Команда)
	
	ПараметрыПодбора = Новый Структура;
	УстановкаЦенКлиент.ОткрытьФормуПодбораФактуры(ПараметрыПодбора, ЭтаФорма, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьШаблоны(Команда)
	
	ПараметрыПодбора = Новый Структура;
	УстановкаЦенКлиент.ОткрытьФормуПодбораШаблонов(ПараметрыПодбора, ЭтаФорма, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоСправочнику(Команда)
	
	УстановкаЦенКлиент.ЗаполнитьМатериалыПоСправочникуФактур(ЭтаФорма, Объект.Материалы);
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьМатериалыПоСправочникуФактурЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат = КодВозвратаДиалога.Да Тогда
        Возврат;
    КонецЕсли;
	
   	ЗаполнитьМатериалыПоСправочникуФактурНаСервере(ДополнительныеПараметры.ДополнительныеПараметрыЗаполнения);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьМатериалыПоСправочникуФактурНаСервере(ДополнительныеПараметрыЗаполнения)
	
	УстановкаЦенСервер.ЗаполнитьМатериалыПоСправочникуФактур(Объект.Материалы, , ДополнительныеПараметрыЗаполнения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоСправочникуШаблонов(Команда)
	
	УстановкаЦенКлиент.ЗаполнитьМатериалыПоСправочникуШаблонов(ЭтаФорма, Объект.Материалы);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьМатериалыПоСправочникуШаблоновЗавершение(Результат, Параметры) Экспорт
	
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

    ЗаполнитьПоСправочникуШаблоновНаСервере();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоСправочникуШаблоновНаСервере()
	
	УстановкаЦенСервер.ЗаполнитьМатериалыПоСправочникуШаблонов(Объект.Материалы);
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоГруппеСправочника(Команда)
	
	Если НЕ ЭтоПродукция Тогда
		УстановкаЦенКлиент.ЗаполнитьМатериалыПоГруппеФактур(ЭтаФорма, Объект.Материалы);
	Иначе
		УстановкаЦенКлиент.ЗаполнитьМатериалыПоГруппеШаблонов(ЭтаФорма, Объект.Материалы);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьМатериалыПоГруппеФактурПослеВыбораГруппы(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьМатериалыПоГруппеНаСервере(ВыбранноеЗначение, ДополнительныеПараметры);
    
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьМатериалыПоГруппеНаСервере(ГруппаФактур, ДополнительныеПараметрыЗаполнения)
	
	УстановкаЦенСервер.ЗаполнитьМатериалыПоСправочникуФактур(Объект.Материалы, ГруппаФактур, ДополнительныеПараметрыЗаполнения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьМатериалыПоГруппеШаблоновПослеВыбораГруппы(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПоГруппеШаблоновНаСервере(ВыбранноеЗначение);
    
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоГруппеШаблоновНаСервере(ГруппаШаблонов)
	
	УстановкаЦенСервер.ЗаполнитьМатериалыПоСправочникуШаблонов(Объект.Материалы, , ГруппаШаблонов);
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТекущимЗначением(Команда)
	
	Если Объект.ВидЦены.Пустая() Тогда
		Состояние("В документе не указан вид цен");
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещенияВопрос = Новый ОписаниеОповещения("ЗаполнитьТекущимЗначениемПослеВопроса",ЭтаФорма);
	ПоказатьВопрос(ОписаниеОповещенияВопрос,"Очистить цены и заполнить текущими значениями?",РежимДиалогаВопрос.ДаНет);	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТекущимЗначениемПослеВопроса(Результат, Параметры) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

    ЗаполнитьТекущимЗначениемНаСервере();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТекущимЗначениемНаСервере()
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МинимальнаяСтоимостьПродукцииСрезПоследних.Фактура КАК Фактура,
	|	МинимальнаяСтоимостьПродукцииСрезПоследних.ЦветФактуры КАК ЦветФактуры,
	|	МинимальнаяСтоимостьПродукцииСрезПоследних.Шаблон КАК Шаблон,
	|	МинимальнаяСтоимостьПродукцииСрезПоследних.Стоимость КАК МинимальнаяСтоимость,
	|	МинимальнаяСтоимостьПродукцииСрезПоследних.СпособОпределения КАК СпособОпределения,
	|	МинимальнаяСтоимостьПродукцииСрезПоследних.ПорядокНаценки КАК ПорядокНаценки
	|ИЗ
	|	РегистрСведений.МинимальнаяСтоимостьПродукции.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Валюта = &Валюта
	|				И ВидНоменклатуры = &ВидНоменклатуры
	|				И ВидЦены = &ВидЦены) КАК МинимальнаяСтоимостьПродукцииСрезПоследних";
	//++ №13380 комментируем
	//|				И ВЫБОР
	//|					КОГДА &ОтборПоПодразделению
	//|						ТОГДА Подразделение = &Подразделение
	//|					ИНАЧЕ ИСТИНА
	//|				КОНЕЦ
	//-- №13380 
	
	Запрос.УстановитьПараметр("Валюта", Объект.Валюта);
	Запрос.УстановитьПараметр("ВидНоменклатуры", Объект.ВидНоменклатуры);
	Запрос.УстановитьПараметр("ВидЦены", Объект.ВидЦены);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	// №13380 Запрос.УстановитьПараметр("ОтборПоПодразделению", ЗначениеЗаполнено(Объект.Подразделение));
	Запрос.УстановитьПараметр("Период", Объект.Дата);
	// №13380 Запрос.УстановитьПараметр("Подразделение", Объект.Подразделение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТекущиеЗначения = РезультатЗапроса.Выгрузить();
	
	Если ЭтоПродукция Тогда
		СтруктураОтбора = Новый Структура("Шаблон");
	Иначе
		СтруктураОтбора = Новый Структура("Фактура, ЦветФактуры");
	КонецЕсли;
	
	Для каждого СтрокаТЧ из Объект.Материалы Цикл
		ЗаполнитьЗначенияСвойств(СтруктураОтбора, СтрокаТЧ);
		НайденныеСтроки = ТекущиеЗначения.НайтиСтроки(СтруктураОтбора);
		Если НайденныеСтроки.Количество() > 0 Тогда
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, НайденныеСтроки[0]); 
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтоимость(Команда)
	
	ОписаниеОповещенияВопрос = Новый ОписаниеОповещения("УстановитьСтоимостьПослеВопроса",ЭтаФорма);
	ПоказатьВопрос(ОписаниеОповещенияВопрос,"Установить общую стоимость на все строки?",РежимДиалогаВопрос.ДаНет);	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтоимостьПослеВопроса(Результат, Параметры) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

	ОписаниеОповещенияВыборЦены = Новый ОписаниеОповещения("УстановитьСтоимостьПослеВыбора", ЭтаФорма);
	ПоказатьВводЗначения(ОписаниеОповещенияВыборЦены, 0, "Введите стоимость");

КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтоимостьПослеВыбора(ВыбЗнач, Параметры) Экспорт
    Если НЕ ВыбЗнач = Неопределено Тогда		
		Для Каждого ТекущаяСтрока Из Объект.Материалы Цикл
			ТекущаяСтрока.МинимальнаяСтоимость = ВыбЗнач;
		КонецЦикла;
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОбщийПорядокНаценки(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("УстановитьОбщийПорядокНаценкиПослеВыбора", ЭтаФорма);
	СписокПорядков = Новый СписокЗначений;
	СписокПорядков.Добавить(ПредопределенноеЗначение("Перечисление.ПорядокНаценкиМинимальнойЦеныНаПродукцию.НаПолотно"));
	СписокПорядков.Добавить(ПредопределенноеЗначение("Перечисление.ПорядокНаценкиМинимальнойЦеныНаПродукцию.ПропорциональноНаВсеСоставляющиеПотолка"));
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ДоступныеЗначения", СписокПорядков);

	ОткрытьФорму("ОбщаяФорма.ВыборИзСписка", ПараметрыФормы, ЭтаФорма, , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОбщийПорядокНаценкиПослеВыбора(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
			
	Для Каждого ТекущаяСтрока Из Объект.Материалы Цикл
		ТекущаяСтрока.ПорядокНаценки = Результат;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОбщийСпособОпределения(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("УстановитьОбщийСпособОпределенияПослеВыбора", ЭтаФорма);
	СписокСпособов = Новый СписокЗначений;
	СписокСпособов.Добавить(ПредопределенноеЗначение("Перечисление.СпособыОпределенияМинимальнойЦеныНаПродукцию.Полотно"));
	СписокСпособов.Добавить(ПредопределенноеЗначение("Перечисление.СпособыОпределенияМинимальнойЦеныНаПродукцию.ВесьПотолокССоставляющими"));
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ДоступныеЗначения", СписокСпособов);

	ОткрытьФорму("ОбщаяФорма.ВыборИзСписка", ПараметрыФормы, ЭтаФорма, , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОбщийСпособОпределенияПослеВыбора(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
			
	Для Каждого ТекущаяСтрока Из Объект.Материалы Цикл
		ТекущаяСтрока.СпособОпределения = Результат;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
